<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a2004129a38c0095637d382e67f6872f950734732b8faf26d49da2a16e7ee852","plan_job_ref":"Job Staging Image Build & Push #3 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7317997724","plan_hash":"fb03f170c730f1fc73e5f365d60d6c6d668ca1f4a0727a0e109adbfa57c71b86","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecrpublic_repository.fastapi-ecr-public must be replaced
-/+ resource "aws_ecrpublic_repository" "fastapi-ecr-public" {
!~      arn             = "arn:aws:ecr-public::806066816337:repository/irezd/fastapi" -> (known after apply)
!~      id              = "*************" -> (known after apply)
!~      registry_id     = "************" -> (known after apply)
!~      repository_name = "irezd/fastapi" -> "dev/irezd/fastapi" # forces replacement
!~      repository_uri  = "public.ecr.aws/p2x0k5a9/irezd/fastapi" -> (known after apply)
-       tags            = {} -> null
!~      tags_all        = {} -> (known after apply)
#        (1 unchanged attribute hidden)

!~      catalog_data {
-           architectures     = [] -> null
+           logo_image_blob   = (known after apply)
-           operating_systems = [] -> null
#            (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  ecr_registry_id     = "************" -> (known after apply)
!~  ecr_repository_name = "irezd/fastapi" -> "dev/irezd/fastapi"
```
</details>

:memo: Plan generated in [Staging Image Build & Push #3](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7317997724)